/*
SQLyog Ultimate v12.09 (64 bit)
MySQL - 5.0.67-community-nt : Database - jsp
*********************************************************************
*/

/*!40101 SET NAMES utf8 */;

/*!40101 SET SQL_MODE=''*/;

/*!40014 SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;
CREATE DATABASE /*!32312 IF NOT EXISTS*/`jsp` /*!40100 DEFAULT CHARACTER SET utf8 */;

USE `jsp`;

/*Table structure for table `user` */

DROP TABLE IF EXISTS `user`;

CREATE TABLE `user` (
  `id` int(100) NOT NULL auto_increment,
  `username` varchar(100) default NULL,
  `password` varchar(100) default NULL,
  `sex` varchar(100) default NULL,
  `age` int(100) default NULL,
  `hobit` varchar(300) default NULL,
  `email` varchar(100) default NULL,
  `address` varchar(1000) default NULL,
  PRIMARY KEY  (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=2019039 DEFAULT CHARSET=utf8;

/*Data for the table `user` */

insert  into `user`(`id`,`username`,`password`,`sex`,`age`,`hobit`,`email`,`address`) values (2019001,'dumu','000','男',18,'看电影','1539011985@qq.com','山东-济南大学'),(2019002,'dumupro','000','男',19,'看电影','1234321567@qq.com','山东-临沂'),(2019003,'杜沐','000','男',20,'听音乐，跑步','34576876547@qq.com','山东-济南'),(2019004,'杜沐pro','000','男',22,'看电影','987565344567@qq.com','济南大学'),(2019005,'陈凯歌','000','男',45,'看电影，听音乐','243546575432@qq.com','中国-北京'),(2019006,'channie','777','女',21,'看电影,听音乐','123456789@qq.com','北京-丰台'),(2019007,'大卫·芬奇','000','男',35,'看电影,跑步','3454676877654@qq.com','美国'),(2019008,'韦斯·安德森','000','男',34,'看电影，读书','23456543456@qq.com','美国'),(2019009,'大卫·林奇','000','男',45,'看电影,听音乐','3454676854@qq.com','美国'),(2019010,'杜衡','000','男',24,'听音乐','2561834761@163.com','英国'),(2019011,'杜琪峰','000','男',57,'看电影,听音乐','2344576864@qq.com','中国-香港'),(2019012,'杜若','000','女',26,'读书','5387632876.com','意大利'),(2019013,'叶问','000','男',21,'看电影','768457123516@qq.com','中国-香港'),(2019014,'宫二','000','女',18,'看电影，读书','4256334726534@qq.com','中国-东北'),(2019015,'王家卫','000','男',30,'看电影','6374582376@qq.com','中国-香港'),(2019016,'贾樟柯','000','男',35,'看电影，听音乐，读书','36285434287@qq.com','中国-山西'),(2019017,'娄烨','000','男',37,'看电影，读书','623594234756@qq.com','中国-北京'),(2019018,'侯孝贤','000','男',49,'看电影，听音乐，读书','766534273652@qq.com','中国-台湾'),(2019019,'杨德昌','000','男',54,'看电影，听音乐','716475823556@qq.com','中国-台湾'),(2019021,'吴彦祖','000','男',30,'读书，跑步','326425347625@qq.com','中国'),(2019022,'章子怡','000','女',30,'看电影，读书','23642834532@qq.com','中国-北京'),(2019023,'赵本山','000','男',45,'看电影，跑步','34528427354@qq.com','中国-东北'),(2019024,'范伟','000','男',46,'看电影，读书','643563475657@qq.com','中国-东北'),(2019026,'卡梅隆','000','男',45,'读书，跑步','34262545432@qq.com','美国'),(2019027,'苏菲·玛索','000','女',39,'读书,跑步','7235427864523@qq.com','法国HHDHS'),(2019028,'杜宗原','666','男',21,'看电影，听音乐，读书，跑步','124123424344@qq.com','中国-山东'),(2019030,'张麻子','000','男',50,'看电影,听音乐,读书,跑步','425634263@qq.com','山上'),(2019032,'武智冲','000','男',45,'听音乐,跑步','456879643@qq.com','民国-鹅城'),(2019035,'黄四郎','000','男',59,'听音乐,读书,跑步','5469086987@qq.com','民国-鹅城'),(2019036,'胡万','000','男',27,'听音乐,跑步','3687545678@qq.com','民国-鹅城'),(2019037,'马邦德','000','男',50,'听音乐,读书','34567756432@qq.com','民国-鹅城');

/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40014 SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS */;
/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;
